package ru.ewromet.converter1;

import javafx.collections.FXCollections;
import javafx.collections.ObservableList;

public class Fixtures {
    private Fixtures() {
    }

    public static ObservableList<OrderRow> getOrderData() {
        return FXCollections.observableArrayList(
                new OrderRow("1", "Деталь 1", "1", "материал", "марка материала", "окраска", "принадлежность",  "1", "комментарий"),
                new OrderRow("2", "Деталь 2", "2", "материал", "марка материала", "окраска", "принадлежность",  "2", "комментарий"),
                new OrderRow("3", "Деталь 3", "3", "материал", "марка материала", "окраска", "принадлежность",  "3", "комментарий"),
                new OrderRow("4", "Деталь 4", "4", "материал", "марка материала", "окраска", "принадлежность",  "4", "комментарий"),
                new OrderRow("5", "Деталь 5", "5", "материал", "марка материала", "окраска", "принадлежность",  "5", "комментарий"),
                new OrderRow("6", "Деталь 6", "6", "материал", "марка материала", "окраска", "принадлежность",  "6", "комментарий"),
                new OrderRow("7", "Деталь 7", "7", "материал", "марка материала", "окраска", "принадлежность",  "7", "комментарий"),
                new OrderRow("8", "Деталь 8", "8", "материал", "марка материала", "окраска", "принадлежность",  "8", "комментарий"),
                new OrderRow("9", "Деталь 9", "9", "материал", "марка материала", "окраска", "принадлежность",  "9", "комментарий"),
                new OrderRow("10", "Деталь 10", "10", "материал", "марка материала", "окраска", "принадлежность",  "10", "комментарий"),
                new OrderRow("11", "Деталь 11", "11", "материал", "марка материала", "окраска", "принадлежность",  "11", "комментарий"),
                new OrderRow("12", "Деталь 12", "12", "материал", "марка материала", "окраска", "принадлежность",  "12", "комментарий"),
                new OrderRow("13", "Деталь 13", "13", "материал", "марка материала", "окраска", "принадлежность",  "13", "комментарий"),
                new OrderRow("14", "Деталь 14", "14", "материал", "марка материала", "окраска", "принадлежность",  "14", "комментарий"),
                new OrderRow("15", "Деталь 15", "15", "материал", "марка материала", "окраска", "принадлежность",  "15", "комментарий"),
                new OrderRow("16", "Деталь 16", "16", "материал", "марка материала", "окраска", "принадлежность",  "16", "комментарий"),
                new OrderRow("17", "Деталь 17", "17", "материал", "марка материала", "окраска", "принадлежность",  "17", "комментарий"),
                new OrderRow("18", "Деталь 18", "18", "материал", "марка материала", "окраска", "принадлежность",  "18", "комментарий"),
                new OrderRow("19", "Деталь 19", "19", "материал", "марка материала", "окраска", "принадлежность",  "19", "комментарий"),
                new OrderRow("20", "Деталь 20", "20", "материал", "марка материала", "окраска", "принадлежность",  "20", "комментарий")
        );
    }

    public static ObservableList<FileRow> getFilesData() {
        return FXCollections.observableArrayList(
                new FileRow("file 1"),
                new FileRow("file 2"),
                new FileRow("file 3"),
                new FileRow("file 4"),
                new FileRow("file 5"),
                new FileRow("file 6"),
                new FileRow("file 7"),
                new FileRow("file 8"),
                new FileRow("file 9"),
                new FileRow("file 10"),
                new FileRow("file 11"),
                new FileRow("file 12"),
                new FileRow("file 13"),
                new FileRow("file 14"),
                new FileRow("file 15"),
                new FileRow("file 16"),
                new FileRow("file 17"),
                new FileRow("file 18"),
                new FileRow("file 19"),
                new FileRow("file 20")
        );
    }
}
