package ru.ewromet.converter1;

import javafx.collections.FXCollections;
import javafx.collections.ObservableList;

public class Fixtures {
    private Fixtures() {
    }

    public static ObservableList<OrderRow> getOrderData() {
        return FXCollections.observableArrayList(
                new OrderRow(1, "Деталь 1", 1, "материал", "марка материала", "окраска", "принадлежность",  1, "комментарий\nкомментарий\nкомментарий\n", "file 1"),
                new OrderRow(2, "Деталь 2\nДеталь 2\nДеталь 2\nДеталь 2\n", 2, "материал", "марка материала", "окраска", "принадлежность",  2, "комментарий", "file 2"),
                new OrderRow(3, "Деталь 3", 3, "материал", "марка материала", "окраска", "принадлежность",  3, "комментарий", "file 3"),
                new OrderRow(4, "Деталь 4", 4, "материал", "марка материала", "окраска", "принадлежность",  4, "комментарий", "file 4"),
                new OrderRow(5, "Деталь 5", 5, "материал", "марка материала", "окраска", "принадлежность",  5, "комментарий", "file 5"),
                new OrderRow(6, "Деталь 6", 6, "материал", "марка материала", "окраска", "принадлежность",  6, "комментарий", "file 6"),
                new OrderRow(7, "Деталь 7", 7, "материал", "марка материала", "окраска", "принадлежность",  7, "комментарий", "file 7"),
                new OrderRow(8, "Деталь 8", 8, "материал", "марка материала", "окраска", "принадлежность",  8, "комментарий", "file 8"),
                new OrderRow(9, "Деталь 9", 9, "материал", "марка материала", "окраска", "принадлежность",  9, "комментарий", "file 9"),
                new OrderRow(10, "Деталь 10", 10, "материал", "марка материала", "окраска", "принадлежность",  10, "комментарий", "file 10"),
                new OrderRow(11, "Деталь 11", 11, "материал", "марка материала", "окраска", "принадлежность",  11, "комментарий", "file 11"),
                new OrderRow(12, "Деталь 12", 12, "материал", "марка материала", "окраска", "принадлежность",  12, "комментарий", "file 12"),
                new OrderRow(13, "Деталь 13", 13, "материал", "марка материала", "окраска", "принадлежность",  13, "комментарий", "file 13"),
                new OrderRow(14, "Деталь 14", 14, "материал", "марка материала", "окраска", "принадлежность",  14, "комментарий", "file 14"),
                new OrderRow(15, "Деталь 15", 15, "материал", "марка материала", "окраска", "принадлежность",  15, "комментарий", "file 15"),
                new OrderRow(16, "Деталь 16", 16, "материал", "марка материала", "окраска", "принадлежность",  16, "комментарий", "file 16"),
                new OrderRow(17, "Деталь 17", 17, "материал", "марка материала", "окраска", "принадлежность",  17, "комментарий", "file 17"),
                new OrderRow(18, "Деталь 18", 18, "материал", "марка материала", "окраска", "принадлежность",  18, "комментарий", "file 18"),
                new OrderRow(19, "Деталь 19", 19, "материал", "марка материала", "окраска", "принадлежность",  19, "комментарий", "file 19"),
                new OrderRow(20, "Деталь 20", 20, "материал", "марка материала", "окраска", "принадлежность",  20, "комментарий", "file 20")
        );
    }
}
